In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic_df = pd.read_csv('../data/titanic_train.csv')

In [3]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_df.columns[titanic_df.isnull().any()].tolist()

['Age', 'Cabin', 'Embarked']

In [7]:
len(titanic_df)

891

In [5]:
titanic_df_drop_all = titanic_df.dropna(how='any')

In [8]:
len(titanic_df_drop_all)

183

In [9]:
titanic_df['Age'].isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [10]:
titanic_df_age = titanic_df.dropna(subset=['Age'])

In [11]:
len(titanic_df_age)

714

In [12]:
titanic_df_age['Age'].isnull().value_counts()

False    714
Name: Age, dtype: int64

In [13]:
titanic_df_age_cabin = titanic_df.dropna(subset=['Age','Cabin',])

In [14]:
len(titanic_df_age_cabin)

185

In [2]:
raw_data = {'first_name': ['Jason', 'Jason', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Miller', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 42, 36, 24, 73],
        'preTestScore': [4, 4, 31, 2, 3],
        'postTestScore': [25, 25, 57, 62, 70]}

In [3]:
raw_data

{'age': [42, 42, 36, 24, 73],
 'first_name': ['Jason', 'Jason', 'Tina', 'Jake', 'Amy'],
 'last_name': ['Miller', 'Miller', 'Ali', 'Milner', 'Cooze'],
 'postTestScore': [25, 25, 57, 62, 70],
 'preTestScore': [4, 4, 31, 2, 3]}

In [17]:
type(raw_data)

dict

In [4]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])

In [5]:
df

  first_name last_name  age  preTestScore  postTestScore
0      Jason    Miller   42             4             25
1      Jason    Miller   42             4             25
2       Tina       Ali   36            31             57
3       Jake    Milner   24             2             62
4        Amy     Cooze   73             3             70

In [6]:
df['full_name']= df['first_name'] + ' ' + df['last_name']

In [32]:
df

  first_name last_name  age  preTestScore  postTestScore     full_name
0      Jason    Miller   42             4             25  Jason Miller
1      Jason    Miller   42             4             25  Jason Miller
2       Tina       Ali   36            31             57      Tina Ali
3       Jake    Milner   24             2             62   Jake Milner
4        Amy     Cooze   73             3             70     Amy Cooze

In [33]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [36]:
df.drop_duplicates()

  first_name last_name  age  preTestScore  postTestScore     full_name
0      Jason    Miller   42             4             25  Jason Miller
2       Tina       Ali   36            31             57      Tina Ali
3       Jake    Milner   24             2             62   Jake Milner
4        Amy     Cooze   73             3             70     Amy Cooze

In [8]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3]}

In [12]:
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])

In [13]:
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

In [11]:
df.drop('reports', axis=1)

             name  year
Cochice     Jason  2012
Pima        Molly  2012
Santa Cruz   Tina  2013
Maricopa     Jake  2014
Yuma          Amy  2014

In [18]:
df[df.name != 'Tina']

           name  reports  year
Cochice   Jason        4  2012
Pima      Molly       24  2012
Maricopa   Jake        2  2014
Yuma        Amy        3  2014

Renaming colum names

In [19]:
df = pd.DataFrame({'$a':[1,2], '$b': [10,20]})

In [20]:
df

   $a  $b
0   1  10
1   2  20

In [24]:
df.columns = ['a', 'b']

In [23]:
df

   a1  b1
0   1  10
1   2  20

Concatenating dataframes

In [28]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [29]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [30]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [31]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [32]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [33]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [34]:
frames = [df1, df2, df3]

In [35]:
result = pd.concat(frames)

In [36]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [37]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data)

In [38]:
df_a

  first_name last_name subject_id
0       Alex  Anderson          1
1        Amy  Ackerman          2
2      Allen       Ali          3
3      Alice      Aoni          4
4     Ayoung   Atiches          5

In [39]:
raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data)
df_b

  first_name last_name subject_id
0      Billy    Bonder          4
1      Brian     Black          5
2       Bran   Balwner          6
3      Bryce     Brice          7
4      Betty    Btisan          8

In [42]:
#Join the two dataframes along rows

df_new = pd.concat([df_a, df_b])
df_new

  first_name last_name subject_id
0       Alex  Anderson          1
1        Amy  Ackerman          2
2      Allen       Ali          3
3      Alice      Aoni          4
4     Ayoung   Atiches          5
0      Billy    Bonder          4
1      Brian     Black          5
2       Bran   Balwner          6
3      Bryce     Brice          7
4      Betty    Btisan          8

In [43]:
#Join the two dataframes along columns
pd.concat([df_a, df_b], axis=1)

  first_name last_name subject_id first_name last_name subject_id
0       Alex  Anderson          1      Billy    Bonder          4
1        Amy  Ackerman          2      Brian     Black          5
2      Allen       Ali          3       Bran   Balwner          6
3      Alice      Aoni          4      Bryce     Brice          7
4     Ayoung   Atiches          5      Betty    Btisan          8

In [40]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data)
df_n

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

  first_name last_name subject_id
0       Alex  Anderson          1
1        Amy  Ackerman          2
2      Allen       Ali          3
3      Alice      Aoni          4
4     Ayoung   Atiches          5
0      Billy    Bonder          4
1      Brian     Black          5
2       Bran   Balwner          6
3      Bryce     Brice          7
4      Betty    Btisan          8

In [63]:
#Join the two dataframes along columns
pd.concat([df_a, df_b], axis=1)

  first_name last_name subject_id first_name last_name subject_id
0       Alex  Anderson          1      Billy    Bonder          4
1        Amy  Ackerman          2      Brian     Black          5
2      Allen       Ali          3       Bran   Balwner          6
3      Alice      Aoni          4      Bryce     Brice          7
4     Ayoung   Atiches          5      Betty    Btisan          8

Joins

inner: use intersection of keys from both frames (SQL: inner join)

outer: use union of keys from both frames (SQL: full outer join)

left: use only keys from left frame (SQL: left outer join)

right: use only keys from right frame (SQL: right outer join)

In [4]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [5]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

In [7]:
#inner join : Only include observations found in both A and B
pd.merge(A, B, how='inner',on ="color")

    color  num size
0   green    1    S
1  yellow    2    M

In [11]:
#Outer join
#Include observations found in either A or B

In [8]:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

In [20]:
#Left join
#Include all observations found in A

In [17]:
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

In [18]:
# Right join
#Include all observations found in B

In [19]:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L

In [9]:
movies = pd.read_csv("../data/u.item.txt", sep='|',encoding="ISO-8859-1")

In [33]:
#https://stackoverflow.com/questions/7048745/what-is-the-difference-between-utf-8-and-iso-8859-1

In [10]:
movies.head()

,1,Toy Story (1995),01-Jan-1995,Unnamed: 3,http://us.imdb.com/M/title-exact?Toy%20Story%20(1995),0,0.1,0.2,1.1,1.2,...,0.6,0.7,0.8,0.9,0.10,0.11,0.12,0.13,0.14,0.15
0,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
1,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
4,6,Shanghai Triad (Yao a yao yao dao waipo qiao) ...,01-Jan-1995,NaN,http://us.imdb.com/Title?Yao+a+yao+yao+dao+wai...,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [11]:
movie_cols = ['movie_id', 'title']

In [12]:
movies = pd.read_csv("../data/u.item.txt", sep='|',header=None, encoding="ISO-8859-1",names=movie_cols, usecols=[0, 1])

In [13]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [14]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_csv("../data/u.data.txt", sep='\t', header=None, names=rating_cols)

In [15]:
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [16]:
movie_ratings = pd.merge(movies, ratings)

In [17]:
movie_ratings.head()

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324

In [20]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}

In [21]:
df = pd.DataFrame(data)

In [27]:
df

   coverage   name  reports  year
0        25  Jason        4  2012
1        94  Molly       24  2012
2        57   Tina       31  2013
3        62   Jake        2  2014
4        70    Amy        3  2014

In [24]:
#Create a capitalization  function
def capitalizer(x):
    return x.upper()

In [25]:
df['name'].apply(capitalizer)

0    JASON
1    MOLLY
2     TINA
3     JAKE
4      AMY
Name: name, dtype: object

In [26]:
df['name'].map(capitalizer)

0    JASON
1    MOLLY
2     TINA
3     JAKE
4      AMY
Name: name, dtype: object

In [27]:
df['cap_name']= df['name'].apply(capitalizer)

In [28]:
df

   coverage   name  reports  year cap_name
0        25  Jason        4  2012    JASON
1        94  Molly       24  2012    MOLLY
2        57   Tina       31  2013     TINA
3        62   Jake        2  2014     JAKE
4        70    Amy        3  2014      AMY

In [29]:
df = df.drop(['name','cap_name'], axis=1)

In [30]:
df

   coverage  reports  year
0        25        4  2012
1        94       24  2012
2        57       31  2013
3        62        2  2014
4        70        3  2014

In [31]:
df.apply(np.sqrt)

   coverage   reports       year
0  5.000000  2.000000  44.855323
1  9.695360  4.898979  44.855323
2  7.549834  5.567764  44.866469
3  7.874008  1.414214  44.877611
4  8.366600  1.732051  44.877611

In [32]:
def times100(x):
    # that, if x is a string,
    if type(x) is str:
        # just returns it untouched
        return x
    # but, if not, return it multiplied by 100
    elif x:
        return 100 * x
    # and leave everything else
    else:
        return

In [33]:
df.applymap(times100)

   coverage  reports    year
0      2500      400  201200
1      9400     2400  201200
2      5700     3100  201300
3      6200      200  201400
4      7000      300  201400

##### Assingments 
apply() vs map() vs applymap in details 
#apply() can apply a function along any axis of the dataframe
#map() applies an operation over each element of a series
#applymap() applies a function to every single element in the entire dataframe.

In [34]:
df1 = pd.DataFrame({"Name":["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"],
                    "City":["Seattle","Seattle","Portland","Seattle","Seattle","Portland"]})

In [35]:
df1

       City     Name
0   Seattle    Alice
1   Seattle      Bob
2  Portland  Mallory
3   Seattle  Mallory
4   Seattle      Bob
5  Portland  Mallory

In [36]:
df1.groupby("City").count()

          Name
City
Portland     2
Seattle      4

##### Assingments 
Understand and execute below code

https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/